In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('train.csv')

In [3]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df1['Pclass'].unique()

array([3, 1, 2])

In [5]:
df1['Pclass'].nunique()

3

In [8]:
df1['Cabin'].nunique()

147

In [10]:
df1['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [20]:
def get_age_group(age):
    return str(age)[0] + '0s'
get_age_group(45)

'40s'

In [16]:
df1 = pd.DataFrame({'name': ['John', 'Mike', 'Emily'],
                    'age': ['23','36','42']})

df1

    name age
0   John  23
1   Mike  36
2  Emily  42

In [17]:
df1['age'].apply(get_age_group)

0    20s
1    30s
2    40s
Name: age, dtype: object

In [22]:
df1['age_group'] = df1['age'].apply(get_age_group)

In [23]:
df1

    name age age_group
0   John  23       20s
1   Mike  36       30s
2  Emily  42       40s

In [35]:
df1['age_group_lambda'] = df1['age'].apply(lambda x: str(x)[0] + '0s')

In [36]:
df1

    name age age_group age_group_lambda
0   John  23       20s              20s
1   Mike  36       30s              30s
2  Emily  42       40s              40s

In [37]:
df1['description'] = df1.apply(lambda row: '{} is {} yeas old'.format(row['name'],row['age']), axis=1)

In [38]:
df1

    name age age_group age_group_lambda           description
0   John  23       20s              20s   John is 23 yeas old
1   Mike  36       30s              30s   Mike is 36 yeas old
2  Emily  42       40s              40s  Emily is 42 yeas old